
## Plan Result (aat)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 2 to destroy.</code></pre>

* Update
  * azurerm_resource_group.rg
* Replace
  * module.caseworker-subscription.azurerm_servicebus_subscription.servicebus_subscription
  * module.judicial-subscription.azurerm_servicebus_subscription.servicebus_subscription


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat"
        name     = "rd-aat"
      ~ tags     = {
          - "Destroy Me"          = "No"
          - "Team Contact"        = "#referencedata"
          - "Team Name"           = "ReferenceData"
          - "application"         = "referencedata"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/hmcts/rd-shared-infrastructure"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#ref-data-support"
          - "environment"         = "staging"
          - "lastUpdated"         = "2024-04-02T17:08:08Z"
          - "managedBy"           = "ReferenceData"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.caseworker-subscription.data.azurerm_servicebus_topic.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_topic" "this" {
      + auto_delete_on_idle                     = (known after apply)
      + default_message_ttl                     = (known after apply)
      + duplicate_detection_history_time_window = (known after apply)
      + enable_batched_operations               = (known after apply)
      + enable_express                          = (known after apply)
      + enable_partitioning                     = (known after apply)
      + id                                      = (known after apply)
      + max_size_in_megabytes                   = (known after apply)
      + name                                    = "rd-caseworker-topic-aat"
      + namespace_name                          = "rd-servicebus-aat"
      + requires_duplicate_detection            = (known after apply)
      + resource_group_name                     = "rd-aat"
      + status                                  = (known after apply)
      + support_ordering                        = (known after apply)
    }

  # module.caseworker-subscription.azurerm_servicebus_subscription.servicebus_subscription must be replaced
-/+ resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      ~ id                                        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.ServiceBus/namespaces/rd-servicebus-aat/topics/rd-caseworker-topic-aat/subscriptions/rd-caseworker-subscription-aat" -> (known after apply)
        name                                      = "rd-caseworker-subscription-aat"
      ~ topic_id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.ServiceBus/namespaces/rd-servicebus-aat/topics/rd-caseworker-topic-aat" # forces replacement -> (known after apply) # forces replacement
        # (10 unchanged attributes hidden)
    }

  # module.judicial-subscription.data.azurerm_servicebus_topic.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_topic" "this" {
      + auto_delete_on_idle                     = (known after apply)
      + default_message_ttl                     = (known after apply)
      + duplicate_detection_history_time_window = (known after apply)
      + enable_batched_operations               = (known after apply)
      + enable_express                          = (known after apply)
      + enable_partitioning                     = (known after apply)
      + id                                      = (known after apply)
      + max_size_in_megabytes                   = (known after apply)
      + name                                    = "rd-judicial-topic-aat"
      + namespace_name                          = "rd-servicebus-aat"
      + requires_duplicate_detection            = (known after apply)
      + resource_group_name                     = "rd-aat"
      + status                                  = (known after apply)
      + support_ordering                        = (known after apply)
    }

  # module.judicial-subscription.azurerm_servicebus_subscription.servicebus_subscription must be replaced
-/+ resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      ~ id                                        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.ServiceBus/namespaces/rd-servicebus-aat/topics/rd-judicial-topic-aat/subscriptions/rd-judicial-subscription-aat" -> (known after apply)
        name                                      = "rd-judicial-subscription-aat"
      ~ topic_id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.ServiceBus/namespaces/rd-servicebus-aat/topics/rd-judicial-topic-aat" # forces replacement -> (known after apply) # forces replacement
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.application_insights.azurerm_application_insights.this has changed
  ~ resource "azurerm_application_insights" "this" {
      ~ app_id                                = "2ef778df-6b37-4801-a805-a249620ebe4e" -> "rd-aat"
        id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.Insights/components/rd-aat"
        name                                  = "rd-aat"
        tags                                  = {
            "Destroy Me"          = "No"
            "Team Contact"        = "#referencedata"
            "Team Name"           = "ReferenceData"
            "application"         = "referencedata"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/hmcts/rd-shared-infrastructure"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#ref-data-support"
            "environment"         = "staging"
            "managedBy"           = "ReferenceData"
        }
        # (15 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":234,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->